[
  {
    "title": "Bok Choy",
    "description": "Bok Choy is used in many dishes due to its crisp texture, sweet flavor and nutritional value. It is also known as white cabbage.",
    "imageUrl": "bok_choy.png",
    "category": "Vegetables"
  },
  {
    "title": "Snake Beans",
    "description": "Snake beans are long and slender green pods with a sweet flavour and crunchy texture. Snake beans have a similar texture to that of green beans, but are slightly lighter green in colour.",
    "imageUrl": "snake_beans.png",
    "category": "Vegetables"
  },
  {
    "title": "Sorrel Leaves",
    "description": "Sorrel is a leafy green vegetable that is native to Europe. It has a sharp, lemony taste.",
    "imageUrl": "sorrel_leaves.png",
    "category": "Vegetables"
  },
  {
    "title": "Rocket Leaves",
    "description": "Rocket leaves or popularly known as arugula or salad rocket is nutritious green-leafy vegetable. The young tender leaves carry a bitter peppery flavor that makes it mostly a salad vegetable.",
    "imageUrl": "rocket_leaves.png",
    "category": "Vegetables"
  },
  {
    "title": "Drumstick",
    "description": "Drum stick or horseradish tree is a tall slender plant grown for it greens, flowers and nutritious pods. It is a very commonly used vegetable in Indian household.",
    "imageUrl": "drumstick.png",
    "category": "Vegetables"
  },
  {
    "title": "Cherry Tomatoes",
    "description": "Cherry tomatoes are a smaller variety of the garden tomatoes, which are comparatively sweeter than the larger fruits.",
    "imageUrl": "cherry_tomatoes.png",
    "category": "Vegetables"
  },
  {
    "title": "Kaffir Lime",
    "description": "Kaffir lime is a rough bumpy green citrus fruit originating from Southeast Asia. The leaves also feature in many recipes because of their aromatic properties.",
    "imageUrl": "kaffir_lime.png",
    "category": "Vegetables"
  },
  {
    "title": "Plantain",
    "description": "Hindi title: Vaayaka They belong to the banana family but are firmer and not consumed raw.",
    "imageUrl": "plantain.png",
    "category": "Vegetables"
  },
  {
    "title": "Turnip",
    "description": "A white bulb taproot vegetable. The leaves and the root have a pungent bitterly taste, similar to raw cabbages and radishes.",
    "imageUrl": "turnip.png",
    "category": "Vegetables"
  },
  {
    "title": "Sweet Potatoes",
    "description": "In China, sweet potatoes, typically of the yellow variety, are baked in a large iron drum, and sold as street-food during winter.",
    "imageUrl": "sweet_potatoes.png",
    "category": "Vegetables"
  },
  {
    "title": "Round Gourd",
    "description": "A mall round gourd, also called baby pumpkin, is a vegetable grown for its immature fruit.",
    "imageUrl": "round_gourd.png",
    "category": "Vegetables"
  },
  {
    "title": "Ridge Gourd",
    "description": "A long vegetable with a dark green ridged skin and a white spongy flesh with soft seeds.",
    "imageUrl": "ridge_gourd.png",
    "category": "Vegetables"
  },
  {
    "title": "Pimiento",
    "description": "These look like smaller versions of red capsicums or bell peppers. These are also called as cherry peppers.",
    "imageUrl": "pimiento.png",
    "category": "Vegetables"
  },
  {
    "title": "Spinach",
    "description": "You can either make a vegetable dish out of it or use it to make burgers, sandwiches and rolls. It may be used in salads.",
    "imageUrl": "spinach.png",
    "category": "Vegetables"
  },
  {
    "title": "Onion",
    "description": "Onions are available in yellow, red or purple and white color. They are mostly used as a compulsory additive to many savory dishes.",
    "imageUrl": "onion.png",
    "category": "Vegetables"
  },
  {
    "title": "Mustard Leaves",
    "description": "Mustard leaves is a popular winter vegetable. They are broad dark green leaves with a flat surface.",
    "imageUrl": "mustard_leaves.png",
    "category": "Vegetables"
  },
  {
    "title": "Mushroom",
    "description": "Mushrooms are fleshy, edible fungi that are a low-calorie food and a good source of Vitamin B.",
    "imageUrl": "mushroom.png",
    "category": "Vegetables"
  },
  {
    "title": "Radish",
    "description": "The radish is a root vegetable native to the Europeans. They are white in color and are mainly used in salads but can be cooked or steamed as well.",
    "imageUrl": "radish.png",
    "category": "Vegetables"
  },
  {
    "title": "Coriander Powder",
    "description": "Grounded from coriander seeds, coriander powder is an essential condiment in the Indian cuisine. It has a pleasing aroma and savour.",
    "imageUrl": "coriander_powder.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Chives",
    "description": "Belonging to the family of onions, Chives are their smallest member. The tiny bulbs have long, thin and hollow green leaves.",
    "imageUrl": "chives.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Galangal",
    "description": "Galangal is a herb like ginger that belongs to the rhizome family. Also known as Thai or blue ginger, it has many medicinal and culinary properties.",
    "imageUrl": "galangal.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Tulsi",
    "description": "Tulsi is a green leaf herb with excellent aromatic properties.",
    "imageUrl": "tulsi.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Sage",
    "description": "Sage is a herb that is native to the Mediterranean. It has gray-green leaves that have a pungent smell and a minty taste. It is mostly used for seasoning.",
    "imageUrl": "sage.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Rosemary",
    "description": "Rosemary is an herb that is used in food for flavoring purpose or for fragrance. Native to the Mediterranean, Rosemary has needle shaped leaves that are highly aromatic.",
    "imageUrl": "rosemary.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Yellow Chilies",
    "description": "Yellow chili peppers offer a sweet pepper flavor and a heat that can vary from very mild to moderately hot.",
    "imageUrl": "yellow_chilies.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Oregano",
    "description": "Oregano is an aromatic herb that is native to northern Europe. It is known for its aromatic and medicinal properties since ancient times.",
    "imageUrl": "oregano.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Nasturtium",
    "description": "Nasturtium is a plant whose leaves and flower both are edible. Fresh and bright nasturtium leaves and flowers have a pepper-like flavor and are nice to use in salads.",
    "imageUrl": "nasturtium.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Salt",
    "description": "Salt is unrefined sodium chloride, an essential ingredient while cooking food worldwide.",
    "imageUrl": "salt.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Mustard Powder",
    "description": "A popular condiment for various dishes like pickles and chutney, salad dressing and meat flavoring due to its pungent flavor.",
    "imageUrl": "mustard_powder.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Paprika",
    "description": "Used mainly to add color to the dishes as it has very mild flavor. It is a deep red coarse powder.",
    "imageUrl": "paprika.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Mint Leaves",
    "description": "Mint is a type of herb with a refreshing flavor. It has a sweet flavor with a cool after taste.",
    "imageUrl": "mint_leaves.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Marjoram",
    "description": "An herb from a sage like plant, Marjoram is commonly used a cooking spice.",
    "imageUrl": "marjoram.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Lemongrass",
    "description": "Lemon grass is a tall perennial grass. It tastes somewhat like ginger with a citrus kick.",
    "imageUrl": "lemongrass.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Red Chili",
    "description": "Dried red pepper may be used whole or powdered. It is really spicy and the intense heat is concentrated in the seeds. Fresh red chillies are milder.",
    "imageUrl": "red_chili.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Saffron",
    "description": "A unique flavored spice, made from the dried stamens of the crocus flower. It is used as a seasoning in many Asian cuisines.",
    "imageUrl": "saffron.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Dried Fenugreek Leaves",
    "description": "Fenugreek leaves are an ancient spice used for flavoring various dishes. The leaves have a bitter taste, but when added to the recipe, titillate the taste buds.",
    "imageUrl": "dried_fenugreek_leaves.png",
    "category": "Spices and Herbs"
  },
  {
    "title": "Amaranth",
    "description": "Amaranth is a tall, bushy plant whose seeds are edible. Similar to quinoa, amaranth belongs to the family of beets, chard, spinach and other weeds.",
    "imageUrl": "amaranth.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Flour",
    "description": "Flour, also known as all-purpose or refined flour, is made from wheat grains after removing the brown covering.",
    "imageUrl": "flour.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Oats",
    "description": "A type of cereal grain grown for its seed. Most of its taste comes from the roasting process after it has been harvested and cleaned.",
    "imageUrl": "oats.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Brown Rice",
    "description": "Brown rice is a variety of rice that is un-milled or partly milled and is considered as a whole grain.",
    "imageUrl": "brown_rice.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Barnyard Millet",
    "description": "These are tiny, white, round grains belonging to the millet family. It is sticky once it is cooked and stays a bit soggy.",
    "imageUrl": "barnyard_millet.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Tapioca",
    "description": "Tapioca is a starch extracted from the cassava plant. They are soft, spongy and chewy in taste.",
    "imageUrl": "tapioca.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Buckwheat",
    "description": "Buckwheat grain is the dried and de-husked seed of the plant. It has a nutty flavor which means that it can be consumed raw or simply roasted.",
    "imageUrl": "buckwheat.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Kidney Beans",
    "description": "These beans are reddish brown in color and have a kidney like shape. They have a very strong taste and are used in both hot and cold recipes.",
    "imageUrl": "kidney_beans.png",
    "category": "Cereals and Pulses"
  },
  {
    "title": "Beef",
    "description": "Meat from cows is known as 'Beef'. Beef meat can be cut into steak, roasts or short ribs.",
    "imageUrl": "beef.png",
    "category": "Meat"
  },
  {
    "title": "Turkey",
    "description": "Turkey is often used as a substitute for chicken. Turkey is often preferred over beef as it has lower calorie content.",
    "imageUrl": "turkey.png",
    "category": "Meat"
  },
  {
    "title": "Pork",
    "description": "Pork is the culinary title for the meat obtained from a domestic pig. It is available in different cuts like tenderloin, loin chops, bacon etc.",
    "imageUrl": "pork.png",
    "category": "Meat"
  },
  {
    "title": "Partridge",
    "description": "The native grey partridge is a small bird which is usually pale and highly flavored. Red-legged partridge is a bigger bird with much milder flavor.",
    "imageUrl": "partridge.png",
    "category": "Meat"
  },
  {
    "title": "Meat Stock",
    "description": "Meat stock is nothing more than meat flavored broth but can provide character to many dishes since it comes loaded with flavor.",
    "imageUrl": "meat_stock.png",
    "category": "Meat"
  },
  {
    "title": "Ham",
    "description": "Ham is the cured and smoked hind leg of a pig. All hams are mostly fully cooked or preserved in salt and sugar, but fresh ham is also available.",
    "imageUrl": "ham.png",
    "category": "Meat"
  },
  {
    "title": "Crab",
    "description": "A crab is a crustacean that is usually found in coastal waters. It is related to the family of lobster, crayfish and shrimp.",
    "imageUrl": "crab.png",
    "category": "Meat"
  },
  {
    "title": "Chicken Stock",
    "description": "Stock forms an important base in soups and sauces. It is a light, clear, flavorful liquid. You can prepare it at home or buy stock cubes or bouillon cubes which dissolve in water.",
    "imageUrl": "chicken_stock.png",
    "category": "Meat"
  },
  {
    "title": "Chicken",
    "description": "Chicken is the most common poultry in the world. Chicken is rich in proteins, potassium, calcium and contains no carbohydrates.",
    "imageUrl": "chicken.png",
    "category": "Meat"
  },
  {
    "title": "Chops",
    "description": "A chop is referred to a thin boneless portion of meat cut from the ribs of the animal. The most commonly kinds of chops are pork and lamb.",
    "imageUrl": "chops.png",
    "category": "Meat"
  },
  {
    "title": "Gouda Cheese",
    "description": "Gouda is a yellow Dutch cheese made from cow's milk. It is a semi-hard cheese popular for its rich, unique flavour and smooth texture.",
    "imageUrl": "gouda_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Feta Cheese",
    "description": "Feta is a type of Greek cheese. It has a very soft and creamy texture. It is mostly produced in blocks and is crumbly.",
    "imageUrl": "feta_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Milk",
    "description": "Milk is a dairy product derived from the mammary gland of mammals, usually cows. It is often converted into dairy products like cheese, butter, curd, cream etc. ",
    "imageUrl": "milk.png",
    "category": "Dairy Products"
  },
  {
    "title": "Brie Cheese",
    "description": "Brie is a type of French cheese made with cow's milk. It is slightly pale in colour with a greyish tinge under the rind. The rind is a white mould and is edible.",
    "imageUrl": "brie_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Cream Cheese",
    "description": "This cheese has a soft creamy texture with a high fat content. Cream cheese is essentially made from un-skimmed cow milk and enriched with cream.",
    "imageUrl": "cream_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Ricotta Cheese",
    "description": "Ricotta is made from milk whey that is left from the production of cheese. It is soft and creamy and does not contain salt which gives it a very light and sweet flavor with a light fluffy texture. ",
    "imageUrl": "ricotta_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Parmesan Cheese",
    "description": "Parmesan cheese is made from raw cow's milk. It is a hard granulated cheese that is cooked but not pressed. Parmesan cheese has a fruity nutty taste.",
    "imageUrl": "parmesan_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Blue Cheese",
    "description": "Blue cheese is characterized by the blue mold spots throughout the body. Blue cheese has a sharp salty taste.",
    "imageUrl": "blue_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Cheddar Cheese",
    "description": "Cheddar cheese is a hard and natural cheese made from cow's milk. Its flavor can range from sharp to mild depending on its make.",
    "imageUrl": "cheddar_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Mascarpone Cheese",
    "description": "Mascarpone Cheese is double or triple cream cheese with a sweeter taste. It is milky-white in color and is easy to spread.",
    "imageUrl": "mascarpone_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Cream",
    "description": "Cream is made out of milk and is a dairy product. Cream is the milk fat that accumulates if milk is allowed to sit undisturbed for a while.",
    "imageUrl": "cream.png",
    "category": "Dairy Products"
  },
  {
    "title": "Provolone Cheese",
    "description": "Provolone cheese is an Italian cheese with a smokey flavor. It is golden-yellow in color.",
    "imageUrl": "provolone_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Mozzarella Cheese",
    "description": "Mozzarella is a semi-soft cheese with a mild taste, though some kinds may have a bitter or sour aftertaste. It is often used in pizza.",
    "imageUrl": "mozzarella_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Yogurt",
    "description": "Yogurt is a fermented milk product which is known for its subtle taste and consistency.It is sold sweetened and flavored and can be served with various kinds of fruit.",
    "imageUrl": "yogurt.png",
    "category": "Dairy Products"
  },
  {
    "title": "Cottage Cheese",
    "description": "Made from curdling milk and straining the whey. Cottage cheese can be eaten raw or cooked. It has a moist texture.",
    "imageUrl": "cottage_cheese.png",
    "category": "Dairy Products"
  },
  {
    "title": "Cranberry",
    "description": "Cranberries are initially white, but they turn deep red when fully ripe. It has a somewhat acidic taste that adds to its sweetness.",
    "imageUrl": "cranberry.png",
    "category": "Fruits"
  },
  {
    "title": "Kiwi",
    "description": "Kiwi fruit is an edible berry that has a soft texture and sweet flesh with a fibrous brown skin.",
    "imageUrl": "kiwi.png",
    "category": "Fruits"
  },
  {
    "title": "Blueberries",
    "description": "Blueberries are a sweet berry eaten whole or also commonly processed into jams, jellies, blueberry pies, etc.",
    "imageUrl": "blueberries.png",
    "category": "Fruits"
  },
  {
    "title": "Mango",
    "description": "Mango fruits have a rich and aromatic flavor. The inside flesh is soft yellow, pulpy and juicy with an inedible stone.",
    "imageUrl": "mango.png",
    "category": "Fruits"
  },
  {
    "title": "Watermelon",
    "description": "Belonging to the same family as cucumber, pumpkin and gourd, watermelon is actually a vegetable! It is, however, consumed as a fruit for it juicy flesh.",
    "imageUrl": "watermelon.png",
    "category": "Fruits"
  },
  {
    "title": "Tomato",
    "description": "Though botanically a fruit, Tomato is often regarded as a vegetable. Tomatoes are a versatile fruit and greatly used in diverse meal courses in varied forms.",
    "imageUrl": "tomato.png",
    "category": "Fruits"
  },
  {
    "title": "Strawberry",
    "description": "Widely appreciated for its distinctive aroma, fiery red color and juicy taste, strawberries are seen as a luxurious berry.",
    "imageUrl": "strawberry.png",
    "category": "Fruits"
  },
  {
    "title": "Water Chestnut",
    "description": "Water Chestnuts are not nuts; instead, they are a floating aquatic plant that grows in marshes. They have a sweet taste with a slight crunch, somewhat nutty.",
    "imageUrl": "water_chestnut.png",
    "category": "Fruits"
  },
  {
    "title": "Papaya",
    "description": "It is a tropical fruit that has a sweet taste, soft texture and are pear shaped.The black seeds of papaya are actually edible and have a peppery taste.",
    "imageUrl": "papaya.png",
    "category": "Fruits"
  },
  {
    "title": "Orange Rind",
    "description": "Orange rind, also called orange zest, is the colored outer skin peeled from an orange. It is aromatic and strong when taken from a fresh orange.",
    "imageUrl": "orange_rind.png",
    "category": "Fruits"
  },
  {
    "title": "Orange",
    "description": "Oranges are a sweet fruit of the same color, mostly consumed whole or in slices, or made into orange juice.",
    "imageUrl": "orange.png",
    "category": "Fruits"
  },
  {
    "title": "Olives",
    "description": "Olives are either green or black in color though the color does not signify its maturity. They are mostly available bottled as they are naturally bitter and hence are cured with lyre, salt or brine.",
    "imageUrl": "olives.png",
    "category": "Fruits"
  },
  {
    "title": "Pear",
    "description": "The pear is a fruit that is juicy and can have a mildly acidic to sweet taste. It typically has a rounded body that tapers into a neck.",
    "imageUrl": "pear.png",
    "category": "Fruits"
  },
  {
    "title": "Mulberry",
    "description": "The fruits turn pink to dark purple or black. It is about 2-3 cms long and has a sweet, tarty flavor. It is similar to blackberry but with a very discreet flavor of its own.",
    "imageUrl": "mulberry.png",
    "category": "Fruits"
  },
  {
    "title": "Lychee",
    "description": "Lychee is a fruit which has an extremely juicy whitish pulp and is usually eaten fresh. It is very sweet and tarty in taste. The fruit is oval shaped.",
    "imageUrl": "lychee.png",
    "category": "Fruits"
  },
  {
    "title": "Lemon Juice",
    "description": "The juice extracted by crushing the pulp of lemon fruit. Lemon juice is most commonly used in a drink called lemonade which is made by using lemon juice, water and sugar.",
    "imageUrl": "lemon_juice.png",
    "category": "Fruits"
  },
  {
    "title": "Lemon Rind",
    "description": "Lemon rind is the peel of the lemon. The outer yellow part of the rind is used a lot for flavouring of cakes, tarts, salads. It is usually grated to add flavour to the food.",
    "imageUrl": "lemon_rind.png",
    "category": "Fruits"
  },
  {
    "title": "Shrimp",
    "description": "The term 'shrimp' term is used broadly and covers a variety of species. Shrimps are mainly characterized by semi-transparent bodies which are flattened from side to side with a flexible abdomen.",
    "imageUrl": "shrimp.png",
    "category": "Seafood"
  },
  {
    "title": "Tuna Fish",
    "description": "Tuna is a saltwater fish that belongs to the mackerel family. Tuna meat has a flaky texture and rich flavor with high oil content.",
    "imageUrl": "tuna_fish.png",
    "category": "Seafood"
  },
  {
    "title": "Sardines",
    "description": "Sardines are silvery, small, oily seawater fish that are soft-boned. They are famously salty, partly due to the way they are generally preserved.",
    "imageUrl": "sardines.png",
    "category": "Seafood"
  },
  {
    "title": "Salmon",
    "description": "Salmon is a fresh water fish that is from the same family as trout. It has a pink-orange colored flesh.",
    "imageUrl": "salmon.png",
    "category": "Seafood"
  },
  {
    "title": "Prawns",
    "description": "Prawns are shrimp-like seafood that are 3-5 cm in length. Although larger than shrimp, they taste similar.",
    "imageUrl": "prawns.png",
    "category": "Seafood"
  },
  {
    "title": "Perch",
    "description": "Perch fish are usually long and rounded with rough scales. These fishes are carnivorous and usually feed on smaller fishes. They are freshwater fish and have tasty, firm meat.",
    "imageUrl": "perch.png",
    "category": "Seafood"
  },
  {
    "title": "Mussels",
    "description": "Mussels are marine bivalves. Mussel is the common title used for a variety of clams: what differentiates them is their elongated shells.",
    "imageUrl": "mussels.png",
    "category": "Seafood"
  },
  {
    "title": "Squids",
    "description": "Squids belong to a class of mollusks known as Cephalopods. Their meat is firm and chewy having a sweet taste. Squid is popularly marketed as Calamari in many English-speaking countries.",
    "imageUrl": "squids.png",
    "category": "Seafood"
  },
  {
    "title": "Fish Stock",
    "description": "Flavored strained liquid made from fresh fish parts, water and seasoning is often termed as fish stock. Fish stock is used to flavor soups and etc.",
    "imageUrl": "fish_stock.png",
    "category": "Seafood"
  },
  {
    "title": "Brown Sugar",
    "description": "Brown sugar is a product of sucrose sugar. It is brown in color because of the presence of molasses in it.",
    "imageUrl": "brown_sugar.png",
    "category": "Sugar and Sugar Products"
  },
  {
    "title": "Honey",
    "description": "Honey is a thick, sticky and sweet tasting liquid that bees produce by taking the nectar from flowers. It is used in desserts, jams, beverages etc.",
    "imageUrl": "honey.png",
    "category": "Sugar and Sugar Products"
  },
  {
    "title": "Caramel",
    "description": "A dark brown confectionery item produced using any type of sugar. It is a thick sweet liquid used as a flavoring, filling and topping for various recipes.",
    "imageUrl": "caramel.png",
    "category": "Sugar and Sugar Products"
  },
  {
    "title": "Cane Sugar",
    "description": "Cane sugar is sugar extracted from sugar cane. It is the most commonly used sugar or sweetening agent.",
    "imageUrl": "cane_sugar.png",
    "category": "Sugar and Sugar Products"
  },
  {
    "title": "Canola Oil",
    "description": "Canola oil comes from the crushed seeds of the canola plant. Canola oil has a pale golden colour, light texture, neutral taste and high heat tolerance.",
    "imageUrl": "canola_oil.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Hazelnut",
    "description": "Hazelnuts grow in clusters on the hazel tree. The nut has an off-white creamy colour and a mildly sweet taste whereas the thin dark brown skin is mildly bitter.",
    "imageUrl": "hazelnut.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Pine Nuts",
    "description": "Edible seeds taken from the pine trees. The oblong seeds are taken from several varieties of pine trees. The seeds are crunchy, sweet and very delicious.",
    "imageUrl": "pine_nuts.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Sunflower Seeds",
    "description": "Sunflower seeds are the fruit of the beautiful, bright yellow coloured sunflower. Shelled seeds have mild nutty taste, but tender texture.",
    "imageUrl": "sunflower_seeds.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Sesame Oil",
    "description": "Edible oil made using sesame seeds, it is used as cooking oil and to enhance flavor.",
    "imageUrl": "sesame_oil.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Pistachio",
    "description": "Pistachios are dry hard-shelled nuts. Its kernel can be eaten whole, either fresh or roasted and salted.",
    "imageUrl": "pistachio.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Olive Oil",
    "description": "Olive oil has a very subtle aroma. It is a very versatile ingredient and is often used in cooking and is preferred more than other forms of oils as it has a lesser fat and butter content.",
    "imageUrl": "olive_oil.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Poppy Seeds",
    "description": "Tiny oil seeds from the opium poppy flower that has a nutty flavour. The seeds may be used whole, ground or to extract poppy seed oil.",
    "imageUrl": "poppy_seeds.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Sesame Seeds",
    "description": "Sesame seeds have a nutty taste and are used in several dishes and as crispy garnish.",
    "imageUrl": "sesame_seeds.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Peanuts",
    "description": "Peanuts are a nutritious legume found all over the world. They can be used for dozens of purposes and are the main ingredient in peanut butter.",
    "imageUrl": "peanuts.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Cashew Nuts",
    "description": "Cashew nuts are a mild and soft nut, often paired with stronger-tasting nuts like peanuts.",
    "imageUrl": "cashew_nuts.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Almonds",
    "description": "Almonds are a dried fruit that is very nutritious. Almonds can be used in many forms, such as sliced (flaked, slivered), almond butter, almond milk and almond oil.",
    "imageUrl": "almonds.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Walnuts",
    "description": "Walnuts are an edible, hard shelled dry fruit used in main dishes and sweets and desserts.",
    "imageUrl": "walnuts.png",
    "category": "Nuts and Oilseeds"
  },
  {
    "title": "Almond Milk",
    "description": "Almond milk is a beverage made with ground almonds. It is often used as a substitute for cow's milk for those who are lactose intolerant or follow a vegan diet.",
    "imageUrl": "almond_milk.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Red Wine Vinegar",
    "description": "Vinegar is a liquid that consists of acetic acid and water. Red Wine Vinegar is made from red wine.",
    "imageUrl": "red_wine_vinegar.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Red Wine",
    "description": "Red wine is produced from the dark-coloured grape varieties. It ranges from light to dark depending on how long it has been aged for.",
    "imageUrl": "red_wine.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Soy Milk",
    "description": "Soy milk is a very nutritious and made from soaking, grinding and then boiling soy beans with water. It is naturally high in fatty acids, proteins, fiber, vitamins and minerals.",
    "imageUrl": "soy_milk.png",
    "category": "Other Ingredients"
  },
  {
    "title": "White Wine",
    "description": "White wine is produced by the fermentation of black or white grape pulp. White wine can be yellowish green, straw yellow or golden yellow in color.",
    "imageUrl": "white_wine.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Yeast",
    "description": "A microscopic living fungus that is an essential ingredient in bread making and brewing.",
    "imageUrl": "yeast.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Rice Vinegar",
    "description": "It is made by fermenting rice. Due to its mild and sweet flavor, it is an ideal ingredient for sweet and tangy dishes, salad dressing and for pickling.",
    "imageUrl": "rice_vinegar.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Sea Salt",
    "description": "As the title suggests, sea salt is obtained from the sea after the water evaporates. The salt is initially in a crystallized form, which can be ground as well.",
    "imageUrl": "sea_salt.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Hoisin Sauce",
    "description": "It is a Chinese sauce pronounced as 'HOY-sin' sauce. It is dark in colour with a thick consistency. It has three predominant flavors - salty, spicy and sweet.",
    "imageUrl": "hoisin_sauce.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Vinegar",
    "description": "Vinegar is a liquid mainly consisting of acetic acid and water. Vinegar is of many kinds, malt vinegar being one of them.",
    "imageUrl": "malt_vinegar.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Chocolate Chips",
    "description": "Chocolate chips are small bits of chocolate. They are available in different sizes, large to miniature. They contain a smaller amount of cocoa butter than cooking chocolate.",
    "imageUrl": "chocolate_chips.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Quinoa",
    "description": "Often considered a grain, quinoa is actually a seed. It is not a cereal grass but is cooked in a similar way to rice or barley.",
    "imageUrl": "quinoa.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Rice Flour",
    "description": "A type of flour that is made from finely milled rice. It is either made from white rice or brown rice. It is a good substitute for wheat flour and for those who are gluten intolerant.",
    "imageUrl": "rice_flour.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Polenta",
    "description": "It is cornmeal that is made from ground maize. It is either eaten directly or is consumed baked, grilled or fried. It has a rich yellow colour, and has a slight sweet taste.",
    "imageUrl": "polenta.png",
    "category": "Other Ingredients"
  },
  {
    "title": "Oyster Sauce",
    "description": "Oyster sauce is a thick brown sauce extracted from boiled oysters and seasonings. The oyster extracts give the sauce a sweet and salty flavor.",
    "imageUrl": "oyster_sauce.png",
    "category": "Other Ingredients"
  }
]